<?PHP

/**
 * ===============================================
 * eapi - 极速API开发框架
 * ===============================================
 * 版本：PHP8.0 +
 * 作者: 
 * 日期: 2021-10-07 16:25
 * ===============================================
 * ES配置文件
 * ===============================================
 */

return [
    // 节点配置
    'HOSTS' => [
       // 可配置多个节点
       [
           // 地址
           'HOST'     => '',
           // 账号
           'USERNAME' => '',
           // 密码
           'PASSWORD' => '',
           // 端口
           'PORT'     => 0
       ]
    ],
    // 重试次数，0为不重试
    'RETRY' => 2,
    // 连接节点超时时间
    'CONNECT_TIMEOUT' => 3,
    // 执行请求超时时间
    'TIMEOUT' => 3
];