<?PHP

/**
 * ===============================================
 * eapi - 极速API开发框架
 * ===============================================
 * 版本：PHP8.0 +
 * 作者: 
 * 日期: 2021-10-07 16:25
 * ===============================================
 * MYSQL配置文件
 * ===============================================
 */

return [
    // 数据库地址
    'HOST'     => '',
    // 数据库账号
    'USERNAME' => '',
    // 数据库密码
    'PASSWORD' => '',
    // 数据库端口
    'PORT'     => 0,
    // 字符集
    'CHARSET'  => 'utf8mb4',
    // 数据库名称
    'DATABASE' => '',
    // 数据表前缀，没有可为空
    'PREFIX'   => ''
];