<?PHP

/**
 * ===============================================
 * eapi - 极速API开发框架
 * ===============================================
 * 版本：PHP8.0 +
 * 作者: 
 * 日期: 2021-10-07 16:25
 * ===============================================
 * REDIS配置文件
 * ===============================================
 */

return [
    // REDIS地址
    'HOST'     => '',
    // REDIS密码，如果没有可为空
    'PASSWORD' => '',
    // REDIS端口
    'PORT'     => 0,
    // 连接超时时间
    'TIMEOUT'  => 3,
    // 库序号，0-15，默认0
    'DATABASE' => 0,
    // KEY统一前缀，没有可为空
    'PREFIX'   => ''
];