<?PHP

/**
 * ===============================================
 * eapi - 极速API开发框架
 * ===============================================
 * 版本：PHP8.0 +
 * 作者: 
 * 日期: 2021-10-07 16:25
 * ===============================================
 * RABBITMQ配置文件
 * ===============================================
 */

return [
    // 队列地址
    'HOST'     => '',
    // 账号
    'USERNAME' => '',
    // 密码
    'PASSWORD' => '',
    // 端口
    'PORT'     => 0,
    // 虚拟主机
    'VHOST'    => '/',
    // 默认交换机
    'EXCHANGE' => '',
    // 默认队列
    'QUEUE'    => '',
    // 默认队列可接收的任务数，最大不能超过65535，一般默认即可
    'QOS'      => 0
];