<?php

/*********************************************************************************
 ***                     CONFIDENTIAL  ---  SURUI STUDIOS                      ***
 *********************************************************************************
 *
 *                       项目 : EApi
 *
 *                       文件 : Conf.php
 *
 *                       开发 : 苏睿 / 317953536@qq.com
 *
 *                       开始 : 2021/10/14
 *
 *                       更新 :
 *
 *                       说明 : Conf的IDE自动完成
 *
 *********************************************************************************
 * Functions:
 *
 *********************************************************************************/

namespace api;

/**
 * Class Conf
 * @package api
 * @method static get(string $key = '')
 * @method static set(string $key, mixed $val)
 * @method static merge(array $conf)
 */
class Conf{}