<?PHP

/**
 * ===============================================
 * eapi - 极速API开发框架
 * ===============================================
 * 版本：PHP8.0 +
 * 作者: 
 * 日期: 2021-10-07 16:25
 * ===============================================
 * 中间件
 * ===============================================
 */

namespace middleware;

class Middleware{

    /**
     * 创建一个中间件，默认提供3个参数
     *
     * $hash 字符串类型 本次访问的hash值，可用于做缓存的KEY
     * $args 参数列表，很多时候我们需要在中间件里使用控制器中定义的私有、公有变量
     * 则需要在注册中间件的时候在名称后加“(...)”
     */
    public function before($hash, $args = [])
    {
        
    }

    /**
     * 创建一个中间件，默认提供3个参数
     *
     * $hash 字符串类型 本次访问的hash值，可用于做缓存的KEY
     * $args 参数列表，很多时候我们需要在中间件里使用控制器中定义的私有、公有变量
     * 则需要在注册中间件的时候在名称后加“(...)”
     * $result 服务执行返回的结果，只有注册为后置中间件才有该参数
     */
    public function after($hash, $args = [], $result = [])
    {
        
    }

}
